<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=4da21686f7eb31c813c86c13d0a6196c51bbb2e5]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=c1683e077ca7b87d422637f16f084a6a8f022b8d]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-dev]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-dev]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-dev-20231113184635539100000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635579200000002]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635588900000003]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-dev]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=undac0]
module.api_app.aws_api_gateway_method.daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-undac0-GET]
module.api_app.aws_api_gateway_integration.daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-undac0-GET]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_deployment.dev: Refreshing state... [id=ujfnb3]
module.api_app.aws_api_gateway_stage.dev: Refreshing state... [id=ags-jfrfryrkn3-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dynamodb_tables.aws_dynamodb_table.tier_list will be created
  + resource "aws_dynamodb_table" "tier_list" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "tier_id"
      + id               = (known after apply)
      + name             = "tier_list-dev"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "tier_id"
          + type = "S"
        }
    }

  # module.lambda_functions.aws_iam_policy.daily_coffee will be created
  + resource "aws_iam_policy" "daily_coffee" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for daily_coffee lambda role"
      + id          = (known after apply)
      + name        = "terraform_lambda_daily_coffee-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:GetItem"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/tier_list*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy will be created
  + resource "aws_iam_role_policy_attachment" "daily_coffee_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_daily_coffee_role-dev"
    }

  # module.lambda_functions.aws_lambda_function.daily_coffee will be updated in-place
  ~ resource "aws_lambda_function" "daily_coffee" {
        id                             = "daily_coffee-dev"
      ~ last_modified                  = "2023-11-13T18:46:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "E6m76ijMEcULwsMif8tAZ/v9lVIt5kqRjcrVt3KgddQ=" -> "hyUvqB3CeCgCaRTrCnZkm9EcPVOGzEOl1E6b+Pwhlnc="
        tags                           = {}
        # (20 unchanged attributes hidden)

      + environment {
          + variables = {
              + "COFFEE_POOL_TABLE_NAME" = "coffee_pool-dev"
              + "REGION"                 = "eu-south-2"
              + "TIER_LIST_TABLE_NAME"   = "tier_list-dev"
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`